<a href="https://colab.research.google.com/github/Sanjar-prog/Telegram-JavaScript-Bot/blob/main/Copy_of_Pandas_kutubxonasi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

In [19]:
import numpy as np

In [20]:
from pandas import Series # series ma'lumotlar tuzilmasi

In [21]:
obj = Series([4, 5, 6, -6.5])

In [22]:
type(obj)

pandas.core.series.Series

In [23]:
print(obj)

0    4.0
1    5.0
2    6.0
3   -6.5
dtype: float64

In [24]:
obj.values

array([ 4. ,  5. ,  6. , -6.5])

In [25]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
obj[0]

4.0

In [27]:
obj2=Series([6, 3, 2, 1], index=['a','b','c','d'])

In [28]:
obj2

a    6
b    3
c    2
d    1
dtype: int64

In [29]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [30]:
obj2['a']

6

In [31]:
obj2[['d', 'b', 'd']]

d    1
b    3
d    1
dtype: int64

In [32]:
obj2[obj2>3]

a    6
dtype: int64

obj2*2

In [33]:
obj2*2

a    12
b     6
c     4
d     2
dtype: int64

In [34]:
obj2

a    6
b    3
c    2
d    1
dtype: int64

In [35]:
np.exp(obj2)

a    403.428793
b     20.085537
c      7.389056
d      2.718282
dtype: float64

In [36]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000}

In [37]:
type(cars_dict)

dict

In [38]:
cars1 = pd.Series(cars_dict)

In [39]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [40]:
type(cars1)

pandas.core.series.Series

In [41]:
cars1 = pd.Series({'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000})

In [42]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [43]:
'Malibu' in cars1

True

In [44]:
'BMW' in cars1

False

In [45]:
cars1['Toyota']

45000

In [46]:
models = ['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota']

In [47]:
cars2 = pd.Series(cars_dict, index=models)

In [48]:
cars2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
dtype: float64

In [49]:
cars2.isnull()

Honda      False
Mazda      False
Lacetti    False
Jaguar      True
Malibu     False
Toyota     False
dtype: bool

In [50]:
cars2.notnull()

Honda       True
Mazda       True
Lacetti     True
Jaguar     False
Malibu      True
Toyota      True
dtype: bool

In [51]:
cars2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
dtype: float64

In [52]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [53]:
cars1 + cars2

Honda       76000.0
Jaguar          NaN
Lacetti     40000.0
Malibu      80000.0
Mazda      104000.0
Toyota      90000.0
dtype: float64

In [54]:
cars2.name = 'Avtosalon'

In [55]:
cars2.index.name = 'Modellar'

In [56]:
cars2

Modellar
Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
Name: Avtosalon, dtype: float64